#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
infra relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/private_server/private_server/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/private_server/private_server

To view this run in a browser, visit:
https://app.terraform.io/app/redline/private_server/runs/run-UgcrHAiMYfhUcAnz

Waiting for the plan to start...

Terraform v1.3.2
on linux_amd64
Initializing plugins and modules...
hcloud_ssh_key.ansible: Refreshing state... [id=8957821]
hcloud_firewall.web_firewall: Refreshing state... [id=603891]
cloudflare_zone.personal_domain: Refreshing state... [id=cee2af2644f6a3325416173e2d4b44f7]
hcloud_server.web: Refreshing state... [id=25709912]
hcloud_volume.data: Refreshing state... [id=24743811]
hcloud_firewall_attachment.firewall_assignments: Refreshing state... [id=603891]
cloudflare_record.a: Refreshing state... [id=394e2bf8790e1e92b4e1fe802421283e]
cloudflare_record.aaaa: Refreshing state... [id=734cda661564197e02bf6743c2f179c9]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # cloudflare_record.aliases["grocy"] will be created
  + resource "cloudflare_record" "aliases" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + ttl             = 300
      + type            = "CNAME"
      + value           = "@"
      + zone_id         = "cee2af2644f6a3325416173e2d4b44f7"
    }

  # cloudflare_zone.personal_domain will be updated in-place
  ~ resource "cloudflare_zone" "personal_domain" {
      - account_id          = "e7606ece5ab8ea11e887ac95eae5b2f6" -> null
        id                  = "cee2af2644f6a3325416173e2d4b44f7"
        # (9 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.


```

</details>

*Pushed by: @RedlineTriad, Action: `pull_request`*